<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html id="help_html">
    <head>
        <title>DJ Help</title>
        <link rel="stylesheet" type="text/css" href="css/app.css" />
    </head>
    <body id="help_body">
    		<table>
    			<tr>
    				<td>
    					<table width="100%">
    						<tr>
    							<td width="100%">
    								<ul class="wrapper-ul" align="center">
    									<li align="center" class="title-help"><h1>Hilfe</h1></li>
    								</ul>
    							</td>
    						</tr>
    					</table>
    				</td>
    			</tr>
    			<tr>
    				<td>
    					<table>
    						<tr>
    							<td width="50%" align="center">
						    		<ul>
							    		<li class="no-hover"><h2>Allgemein:</h2></li>
										<li class="no-hover">DJam ist eine virtuelle DJ Simulation und wurde im Zuge eines Kurses an der Universit&auml;t Regensburg entwickelt.</li>
										<li class="no-hover">Die Applikation ist kein Profi Tool und kann kein professionelles DJ-Set ersetzen. 
															 Vielmehr versucht sie dem Nutzer eine spielerische M&ouml;glichkeit zu bieten, 
															 seiner Kreativit&auml;t freien Lauf zu lassen um immer neue Songs zu kreieren. 
															 Die verschiedenen Features, die das Tool bietet werden darunter n&auml;her erl&auml;utert.</li>
										<li class="no-hover">Viel Spa&szlig; w&uuml;nschen die Entwickler (Michael Adlfinger, Susanne Forster, Lukas Lamm)</li>
							    	</ul>    								
    							</td>
    							<td width="50%" align="center">
						    		<ul>
							    		<li class="no-hover"><h2>Tastaturbelegung:</h2></li>
										<li class="no-hover">
											<ul align="left">
												<li class="no-hover">&larr; = Start/Stop Platte links</li>
												<li class="no-hover">&rarr; = Start/Stop Platte rechts</li>
												<li class="no-hover">&darr; = Start/Stopp Drummachine</li>
												<li class="no-hover">&nbsp;</li>
											</ul>
											<ul class="no-hover">
												<li class="no-hover">1 = Start/Stop Spur 1</li>
												<li class="no-hover">2 = Start/Stop Spur 2</li>
												<li class="no-hover">3 = Start/Stop Spur 3</li>
												<li class="no-hover">4 = Start/Stop Spur 4</li>
											</ul>
										</li>
							    	</ul>   								
    							</td>
    						</tr>
    					</table>
    				</td>
    			</tr>
    			<tr>
    				<td>
    					<table width="100%">
    						<tr>
    							<td>
						    		<ul class="tipp-block">
							    		<li class="no-hover"><h2>Filter:</h2></li>
										<li class="no-hover">Hier kannst du verschiedene Filter zuschalten. Der Tiefpass filtert hohe Frequenz heraus, der Hochpass filtert niedrige Frequenzen heraus.Durch Klick auf ein Instrument, wird der Filter angewendet. Mit dem Slider kannst du die Intensit&auml;t regeln.</li>
							    	</ul>  								
    							</td>
    							<td>
    								<ul class="tipp-block">
								    	<li class="no-hover"><h2>Metronom:</h2></li>
										<li class="no-hover">Das Metronom zeigt immer die aktuelle Position im Takt an.</li>
										<li class="no-hover">Wenn du ein neues Instrument startest, wird dieses erst zum Anfang des n&auml;chsten Takts gestartet um die Synchronisation der einzelnen Instrumente zu vereinfachen.</li>
								    </ul>
    							</td>
    							<td>
    								<ul class="tipp-block">
							    		<li class="no-hover"><h2>Groovy:</h2></li>
										<li class="no-hover">Groovy gibt dir Tipps zu den einzelnen Instrumenten, wenn du mit der Maus dar&uuml;ber f&auml;hrst. Du kannst ihn per Klick ein- und ausblenden.<br><br></li>
							    	</ul>
    							</td>
    							<td>
    								<ul class="tipp-block">
							    		<li class="no-hover"><h2>Turntables:</h2></li>
										<li class="no-hover">Auf die Turntables kannst du Samples aus der Plattenbox legen. Klicke dazu auf die Box und ziehe das gew&uuml;nschte Sample mit gedr&uuml;ckter Maustaste auf den Plattenteller. Der 'Start'-Knopf startet bzw. stoppt die Platte.</li>
							    	</ul>
    							</td>
    						</tr>
    						<tr>
    							<td>
    								<ul class="tipp-block">
							    		<li class="no-hover"><h2>Equalizer:</h2></li>
										<li class="no-hover">Mit dem Equalizer kannst du die Lautst&auml;rke der einzelnen Instrumente mit dem Slider anpassen und die Balance zwischen den Turntables verschieben. Mit den 'M'- und 'S'-Kn&ouml;pfen kannst du die Spuren auf Mute bzw. Solo setzen.</li>
							    	</ul>
    							</td>
    							<td>
    								<ul class="tipp-block">
							    		<li class="no-hover"><h2>Plattenbox:</h2></li>
										<li class="no-hover">Bei Klick auf die Plattenbox &ouml;ffnet sich ein Coverflow, aus dem du Samples per Drag&Drop auf die Turntables legen kannst. Mit den Pfeilen kannst du durch den Coverflow navigieren.</li>
							    	</ul>
    							</td>
    							<td>
    								<ul class="tipp-block">
							    		<li class="no-hover"><h2>Spuren:</h2></li>
										<li class="no-hover">Hier kannst du zus&auml;tzliche Spuren zum Set hinzuf&uuml;gen. Klicke dazu auf die gr&uuml;ne Schaltfl&auml;che und w&auml;e aus dem Men&uuml; das gew&uuml;nschte Sample aus den verschiedenen Kategorien per Klick.</li>
							    	</ul>
    							</td>
    							<td>
    								<ul class="tipp-block">
							    		<li class="no-hover"><h2>Drummachine:</h2></li>
										<li class="no-hover">Mit der Drummachine kannst du den Grundbeat deiner Session bestimmen. Es stehen drei Beispiel-Sets zur Verf&uuml;gung. Klicke auf die Pads in der jeweiligen Zeile und Spalte um einen Taktschlag zu setzen bzw. zu entfernen. Mit den beiden 'Save'-Buttons kannst du zwei Patterns speichern und diese &uuml;ber die Buttons 'P1' bzw. 'P2' abrufen.</li>
							    	</ul>
    							</td>
    						</tr>
    					</table>
    				</td>
    			</tr>
    		</table>
    		
    </body>
</html>